Autodesk.Revit.DB.Architecture.RailJoinOption
The join type of the system rails.
Since:
2013

Autodesk.Revit.DB.Architecture.RailJoinOption.Fillet
The rails will be joined by a fillet connection.

Autodesk.Revit.DB.Architecture.RailJoinOption.Miter
The rails will be joined by a miter connection.

Autodesk.Revit.DB.Architecture.RailJoinOption.ByType
The rails will be joined according to the settings in the rail type.